#+TITLE: Haiku

* Ready to haiku format
#+begin_src bash
  . ~/Documents/github/kenjirofukuda/sandbox/bootstrap/common.sh
  ensure_repo "owenca" "haiku-format"
  which "haiku-format"
#+end_src

#+RESULTS:
| mkdir | -p                                              | /boot/home/Documents/github/owenca |               |
| cd    | /boot/home/Documents/github/owenca/haiku-format |                                    |               |
| git   | fetch                                           |                                    |               |
| git   | diff                                            | master                             | origin/master |
|       |                                                 |                                    |               |


* AAA
#+begin_src bash
  pwd
  jam -c
#+end_src

#+RESULTS:
| /boot/home/Documents/github/kenjirofukuda/sandbox/haiku |                   |              |
| ...patience...                                          |                   |              |
| ...found                                                | 15                | target(s)... |
| ...updating                                             | 2                 | target(s)... |
| C++                                                     | obj.X86/TestApp.o |              |
| Link                                                    | obj.X86/TestApp   |              |
| Chmod1                                                  | obj.X86/TestApp   |              |
| MimeSet                                                 | obj.X86/TestApp   |              |
| ...updated                                              | 2                 | target(s)... |
